## Pandas Skill Test

1. 데이터프레임을 생성해 봅시다!
- 데이터프레임명 : name_df
- 컬럼명 : 날짜 이름 나이 성별 기수
- 모든 컬럼의 데이터 타입은 object로 입력해 주세요.

In [74]:
import pandas as pd

In [75]:
name_df = pd.DataFrame(
    {'날짜' : ['20221024', '20221024', '20221024', '20221024'],
     '이름' : ['김중헌', '이하림', '조민정', '주채연'],
     '나이' : ['29', '29', '29', '29'],
     '성별' : ['남', '여', '여', '여'],
     '기수' : ['4', '5', '5', '5'],
     }
)
name_df

         날짜   이름  나이  성별 기수
0  20221024  김중헌  29  남자  4
1  20221024  이하림  29  여자  5
2  20221024  조민정  29  여자  5
3  20221024  주채연  29  여자  5

In [87]:
name_df = pd.DataFrame(
    [['20221024', '김중헌', '29', '남', 4],
    ['20221024', '이하림', '29', '여', 5],
    ['20221024', '조민정', '29', '여', 5],
    ['20221024', '주채연', '29', '여', 5]],
    columns = ['날짜', '이름', '나이', '성별', '기수']
)
name_df

         날짜   이름  나이 성별  기수
0  20221024  김중헌  29  남   4
1  20221024  이하림  29  여   5
2  20221024  조민정  29  여   5
3  20221024  주채연  29  여   5

### 2. 데이터 타입 변경
- name_df 컬럼들의 데이터 타입을 출력하세요.
- 날짜 컬럼의 데이터 타입을 datetime으로 변경하세요.
- 나이 컬럼의 데이터 타입을 int로 변경하세요.

In [77]:
name_df.dtypes

날짜    object
이름    object
나이    object
성별    object
기수     int64
dtype: object

In [78]:
name_df["날짜"].dtype

dtype('O')

In [79]:
name_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   날짜      4 non-null      object
 1   이름      4 non-null      object
 2   나이      4 non-null      object
 3   성별      4 non-null      object
 4   기수      4 non-null      int64
dtypes: int64(1), object(4)
memory usage: 288.0+ bytes

In [80]:
name_df['날짜'] = pd.to_datetime(name_df['날짜'], format='%Y%m%d')
name_df['나이'] = name_df['나이'].astype(int)
name_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   날짜      4 non-null      datetime64[ns]
 1   이름      4 non-null      object
 2   나이      4 non-null      int32
 3   성별      4 non-null      object
 4   기수      4 non-null      int64
dtypes: datetime64[ns](1), int32(1), int64(1), object(2)
memory usage: 272.0+ bytes

## 3. 컬럼 변경
- 이름 컬럼의 컬럼명을 name으로 바꾸세요.
- 컬럼의 순서를 날짜 name 성별 기수 나이 로 바꾸세요.

In [81]:
name_df.rename(columns={'이름':'name'}, inplace=True)
name_df

          날짜 name  나이 성별  기수
0 2022-10-24  김중헌  29  남   4
1 2022-10-24  이하림  29  여   5
2 2022-10-24  조민정  29  여   5
3 2022-10-24  주채연  29  여   5

In [82]:
name_df.columns

Index(['날짜', 'name', '나이', '성별', '기수'], dtype='object')

In [83]:
name_df = name_df[['날짜', 'name', '성별', '기수', '나이']]
name_df

          날짜 name 성별  기수  나이
0 2022-10-24  김중헌  남   4  29
1 2022-10-24  이하림  여   5  29
2 2022-10-24  조민정  여   5  29
3 2022-10-24  주채연  여   5  29

## 4. 로우 값 변경
- 남 은 남자로, 여 는 여자로 바꾸세요.

In [84]:
name_df['성별'] = name_df['성별'].str.replace('남', '남자')
name_df['성별'] = name_df['성별'].str.replace('여', '여자')
name_df

          날짜 name  성별  기수  나이
0 2022-10-24  김중헌  남자   4  29
1 2022-10-24  이하림  여자   5  29
2 2022-10-24  조민정  여자   5  29
3 2022-10-24  주채연  여자   5  29

In [88]:
name_df

         날짜   이름  나이 성별  기수
0  20221024  김중헌  29  남   4
1  20221024  이하림  29  여   5
2  20221024  조민정  29  여   5
3  20221024  주채연  29  여   5

In [93]:
name_df['성별'] = name_df['성별'].str.replace({'남': '남자'}, {'여': '여자'})
name_df

TypeError: repl must be a string or callable

In [86]:
name_df['기수'].sort_values(ascending=False)

1    5
2    5
3    5
0    4
Name: 기수, dtype: int64